Revit 2026 API

# MetalType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetalType" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetalType
```
```vb
Public Enumeration MetalType
```
```cpp
public enum class MetalType
```
```fsharp
type MetalType
```

| Member name | Value | Description |
| --- | --- | --- |
| Aluminum | 0 |  |
| Brass | 4 |  |
| Bronze | 5 |  |
| Chrome | 2 |  |
| Copper | 3 |  |
| GalvanizedAlu | 1 |  |
| StainlessSteel | 6 |  |
| Zinc | 7 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace